###############################################################################
# Created by write_sdc
###############################################################################
current_design PE
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 6.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_in[0]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_in[1]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_in[2]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_in[3]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_in[4]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_in[5]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_in[6]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_in[7]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_in[0]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_in[1]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_in[2]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_in[3]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_in[4]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_in[5]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_in[6]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_in[7]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clear_acc}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {v_a_in}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {v_b_in}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_out[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_out[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_out[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_out[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_out[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_out[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_out[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {a_out[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_out[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_out[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_out[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_out[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_out[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_out[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_out[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b_out[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[16]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[17]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[18]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[19]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[20]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[21]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[22]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[23]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[24]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[25]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[26]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[27]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[28]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[29]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[30]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[31]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {psum[9]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {v_a_out}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {v_b_out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {v_a_out}]
set_load -pin_load 0.0334 [get_ports {v_b_out}]
set_load -pin_load 0.0334 [get_ports {a_out[7]}]
set_load -pin_load 0.0334 [get_ports {a_out[6]}]
set_load -pin_load 0.0334 [get_ports {a_out[5]}]
set_load -pin_load 0.0334 [get_ports {a_out[4]}]
set_load -pin_load 0.0334 [get_ports {a_out[3]}]
set_load -pin_load 0.0334 [get_ports {a_out[2]}]
set_load -pin_load 0.0334 [get_ports {a_out[1]}]
set_load -pin_load 0.0334 [get_ports {a_out[0]}]
set_load -pin_load 0.0334 [get_ports {b_out[7]}]
set_load -pin_load 0.0334 [get_ports {b_out[6]}]
set_load -pin_load 0.0334 [get_ports {b_out[5]}]
set_load -pin_load 0.0334 [get_ports {b_out[4]}]
set_load -pin_load 0.0334 [get_ports {b_out[3]}]
set_load -pin_load 0.0334 [get_ports {b_out[2]}]
set_load -pin_load 0.0334 [get_ports {b_out[1]}]
set_load -pin_load 0.0334 [get_ports {b_out[0]}]
set_load -pin_load 0.0334 [get_ports {psum[31]}]
set_load -pin_load 0.0334 [get_ports {psum[30]}]
set_load -pin_load 0.0334 [get_ports {psum[29]}]
set_load -pin_load 0.0334 [get_ports {psum[28]}]
set_load -pin_load 0.0334 [get_ports {psum[27]}]
set_load -pin_load 0.0334 [get_ports {psum[26]}]
set_load -pin_load 0.0334 [get_ports {psum[25]}]
set_load -pin_load 0.0334 [get_ports {psum[24]}]
set_load -pin_load 0.0334 [get_ports {psum[23]}]
set_load -pin_load 0.0334 [get_ports {psum[22]}]
set_load -pin_load 0.0334 [get_ports {psum[21]}]
set_load -pin_load 0.0334 [get_ports {psum[20]}]
set_load -pin_load 0.0334 [get_ports {psum[19]}]
set_load -pin_load 0.0334 [get_ports {psum[18]}]
set_load -pin_load 0.0334 [get_ports {psum[17]}]
set_load -pin_load 0.0334 [get_ports {psum[16]}]
set_load -pin_load 0.0334 [get_ports {psum[15]}]
set_load -pin_load 0.0334 [get_ports {psum[14]}]
set_load -pin_load 0.0334 [get_ports {psum[13]}]
set_load -pin_load 0.0334 [get_ports {psum[12]}]
set_load -pin_load 0.0334 [get_ports {psum[11]}]
set_load -pin_load 0.0334 [get_ports {psum[10]}]
set_load -pin_load 0.0334 [get_ports {psum[9]}]
set_load -pin_load 0.0334 [get_ports {psum[8]}]
set_load -pin_load 0.0334 [get_ports {psum[7]}]
set_load -pin_load 0.0334 [get_ports {psum[6]}]
set_load -pin_load 0.0334 [get_ports {psum[5]}]
set_load -pin_load 0.0334 [get_ports {psum[4]}]
set_load -pin_load 0.0334 [get_ports {psum[3]}]
set_load -pin_load 0.0334 [get_ports {psum[2]}]
set_load -pin_load 0.0334 [get_ports {psum[1]}]
set_load -pin_load 0.0334 [get_ports {psum[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clear_acc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {v_a_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {v_b_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a_in[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b_in[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
